//
//
// HeroesData.swift
// iosadv-homeworks-swiftUI
//
// Created by Александр Востриков
//
    

import Foundation

let heroesData = [
    Hero(id: 1, name: "Neo", film: "Матрица", image: "neo",
         description: """
                      Имя: Томас А. Андерсон.
                      Дата рождения: 13 сентября 1971 года.
                      Место рождения: Capital City, USA
                      Родители: Джон Андерсон и Мишель Андерсон (в девичестве Макгэй)
                      Дата окончания срока действия паспорта: 11 сентября 2001 года.
                      Окончил Центральную школу и Высшую школу Оуэна Патерсона
                      """
        ),
    Hero(id: 2, name: "Лилу", film: "5 элемент", image: "element",
         description: """
                      Способности
                      Нечеловеческая сила: Лилу имеет более высокую силу, чем можно было бы ожидать от обычного человека, так как она пробивает стекло, которое ранее было описано как бронированное. Кроме того, она проявляет свою силу, когда прыгает через металлическую стену во время её побега из лаборатории в Нью-Йорке. Она также была в состоянии уничтожить нож одним ударом. Кроме того, она была в состоянии выбить Мангалоров в несколько раз больше, чем они её.
                      Повышенная прочность: Она также показывает некоторую степень устойчивости к физическим повреждениям, так как она падает с большой высоты через металлическую крышу кабины такси Корбена Далласа с небольшими ранами на её теле и лице.
                      Моментальное обучение: Лилу способна выучить английский и 5000-летную историю человечества в течение всего нескольких дней. В то время как её знание английского было слабое на протяжении большей части фильма, кажется, что воздействие большого количества людей на борту звездолёта в Флостонский Рай позволило ей быстро выучить английский язык через погружение. В начале фильма она не может говорить по-английски, используя только то, что Корнилиус описывает как Божественный язык — самый древний во Вселенной. Она умеет говорить короткими, разделёнными предложениями на протяжении всего фильма, однако к концу она почти свободно говорит на английском языке.
                      Большая ловкость: Лилу обладает большой маневренностью, чем обычный человек, что видно, когда она прыгнула с несколькими сальто назад, уклоняясь от выстрелов, и запрыгнула в воздуховод.
                      Усовершенствованные рефлексы: Она в состоянии уклоняться от пуль с абсолютной лёгкостью.
                      Исцеляющий фактор: Когда в неё стреляли и она была тяжело ранена, она исцеляется в течение по крайней мере часа.
                      Связь с Элементами: Наиболее ключевой особенностью Лилу является возможность объединить силу четырёх стихий камней, чтобы сформировать Божественный Свет. Из-за этого, она описана как Пятый Элемент. Божественный Свет создается за счет сочетания этих четырёх камней, направляются через Лилу. Это единственное оружие, которое может победить Высшее Зло, которое появляется, чтобы уничтожить Землю каждые 5000 лет.
                      Рукопашный бой: Она обладает мастерскими боевыми навыками, используя свою превосходную ловкость и силу, чтобы с абсолютной легкостью в одиночку победить отряд Мангалоров, которые являются высококвалифицированными воинами.
                      """
        ),
    Hero(id: 3, name: "Наташа Романофф", film: "Чёрная вдова", image: "blackwidow",
         description: """
                      Наташа родилась 20 декабря 1928 года в Сталинграде (ныне Волгоград), РСФСР, СССР. Первая и самая известная Чёрная вдова — русский агент, шпионка, мастер боевых искусств и снайпер, оснащённая арсеналом высокотехнологичного оружия, включая пару наручных энергетических орудий, названных «укус вдовы». Первоначально Наташа не носила никакого специального костюма, она была замечена лишь в вечернем платье и вуали. Романова в конце концов переезжает в США по нескольким причинам, в том числе, и из-за чувств к преступнику и супергерою-лучнику, Соколиному глазу.
                      """
        ),
    Hero(id: 4, name: "Леопольд", film: "Приключения кота Леопольда", image: "leopold",
         description: """
                      Рыжий кот Леопольд, средних лет, живёт в доме № 8/16 по улице Мурлыкина, рядом с кафе и ателье. Изображается он как типичный интеллигент: не курит, не пьёт, не повышает голоса. Почти всегда, не исключая и уличной обстановки, одет в мягкие домашние синие брюки, закатанные до колена, жёлтую водолазку, домашние тапочки и неизменный галстук-бабочку, который не снимает даже во время купани. Леопольд отличается жизненным оптимизмом, настоящий кот-миротворец, и его главное жизненное кредо «ребята, давайте жить дружно». Он не обижается на мышей и не страдает от их пакостей — лишь неодобрительно качает головой.
                      """
        ),
    Hero(id: 5, name: "Алита", film: "Алита: Боевой ангел", image: "alita",
         description: """
                      Cтрадающая амнезией женщина-киборг. Ее неповрежденные голова и грудь в состоянии анабиоза найдены экспертом по кибермедицине Дайсуке Идо на местной мусорной свалке. Идо удается оживить ее и, обнаружив, что она потеряла память, называет ее Алита в честь своей недавно умершей кошки. Восстановленная Алита вскоре обнаруживает, что инстинктивно помнит легендарное боевое искусство Panzer Kunst, хотя больше ничего не помнит. Алита использует свое Танковое искусство, чтобы сначала стать охотником за головами, убивая киборгов-преступников на Свалке, а затем стать звездным игроком в жестоком гладиаторском спорте Мотобол. Во время боя Алита пробуждает воспоминания о своей прежней жизни на Марсе. Она связывается с плавучим городом Залем (Тифарес в некоторых старых переводах) в качестве одного из их агентов и отправляется выслеживать преступников. Прежде всего, это безумный гений Дести Нова, у которого сложные, постоянно меняющиеся отношения с Алитой.
                      """
        ),
    Hero(id: 6, name: "Железный человек", film: "Железный человек", image: "chelovek",
         description: """
                      Сын богатого промышленника Говарда Старка, Тони был гениальным изобретателем и механиком. Он унаследовал бизнес отца в возрасте 21 года, превратив компанию в одного из лидирующих производителей оружия. Старк был ранен осколком в грудь во время полевого испытания на пригодность боевой брони, которая должна была наделить солдат боевыми способностями. Старка взял в плен оружейный барон Wong Chu, вынудив его создать оружие массового поражения — только тогда Тони получил бы операцию, необходимую для спасения его жизни. Вместе со своим товарищем и бывшим пленным Хо Йинсеном, лауреатом Нобелевской премии по физике, Старк начал работать над модифицированным экзоскелетом, оснащённым тяжёлым вооружением. В секрете даже от Старка, Йинсен сконструировал защитную грудную пластинку для поддержания раненого сердца изобретателя. Старк надел костюм, чтобы попробовать сбежать из плена, но сам Профессор Йинсен был убит в решающей схватке. Он отдал свою жизнь, чтобы Железный человек смог жить. Победив оружейного барона, Старк вернулся в Америку и переконструировал костюм. Выдумав историю, что Железный человек был его охранником, Старк вступил в двойную жизнь как миллиардер-изобретатель и костюмированный искатель приключений. Ранние враги посылали шпионов и иностранных агентов в намерении украсть броню Старка и его военные секреты. Спустя некоторое время Старк прекратил защищать только свои личные интересы. Он также стал заниматься вопросами национальной и международной безопасности. Железный человек даже помог основать Мстителей и стал спонсором их команды.
                      """
        ),
    Hero(id: 7, name: "Игорь Гром", film: "Майор Гром", image: "grom",
         description: """
                      Майор полиции, наделённый острым чувством справедливости и строго следующий принципам морали. Несмотря на положительные качества, порой бывает излишне агрессивным и прямолинейным. Имеет манеру решать сложные проблемы при помощи грубой силы, однако при необходимости способен действовать более аккуратно. Обладает развитым логическим мышлением, а также хорошей физической подготовкой[18]. Всегда носит кепку, серый шарф и коричневую куртку, часто его приметами в комиксе называют волевой подбородок и брови в форме молний.
                      """
        ),
    Hero(id: 8, name: "Роберт Брюс Бэннер", film: "Мстители", image: "halk",
         description: """
                      Во время экспериментального взрыва гамма-бомбы учёный Брюс Бэннер бросился спасать подростка, приехавшего на испытательный полигон. Столкнув мальчишку, Рика Джонса, в траншею, сам Бэннер оказался во взрыве, получив массивную дозу радиации. Позже он очнулся в лазарете, казалось, сравнительно невредимым, но ночью преобразовался в громоздкую серую форму, проломил стену и сбежал. Солдат из последовавшей поисковой партии назвал неопознанное создание «громадиной»
                      """
        ),
    Hero(id: 9, name: "Индиана Джонс", film: "Храм судьбы", image: "indy",
         description: """
                      Прозвище: Индиана
                      Пол: мужской
                      Род занятий: учёный-археолог, доктор исторических наук, офицер французской разведки в годы Первой мировой войны, агент спецслужб США в годы Второй мировой войны
                      """
        ),
    Hero(id: 10, name: "Алекс Мёрфи", film: "Робокоп", image: "robo",
         description: """
                      Являлся обычным офицером полиции Детройта по имени Алекс Мёрфи, пока не был убит при исполнении служебных обязанностей. После этого корпорация «OCP» забрала тело Алекса и создала на базе его центральной нервной системы Робокопа. Длительное время спустя получившийся киборг вспомнил отдельные моменты своего прошлого и вновь стал называть себя Алексом Мёрфи.
                      """
        ),
    Hero(id: 11, name: "Кларк Кент", film: "Супермен", image: "sman",
         description: """
                      Супермен появился на свет на планете Криптон и при рождении получил имя Кал-Эл. Ещё младенцем он был отправлен на Землю своим отцом-учёным Джор-Элом за несколько минут до уничтожения Криптона. Его нашла и приютила семья канзасского фермера. Земные родители дали ребёнку имя Кларк Кент. Ещё в раннем возрасте у мальчика проявились сверхчеловеческие способности, которые он решил применять на благо человечеству.
                      """
        ),
    Hero(id: 12, name: "Питер Паркер", film: "Человек-паук", image: "spider",
         description: """
                      Одарённый в науке подросток-сирота, который живёт со своими дядей и тётей в Форест-Хилс, Куинс, Нью-Йорк. Питер — отличник, из-за чего подвергается насмешкам сверстников, зовущих его «книжным червём». Во время научной выставки его случайно кусает радиоактивный паук. Благодаря этому он получает «паучьи» сверхспособности — такие как, например, суперсилу, способность передвигаться по стенам и феноменальную прыгучесть. Пользуясь своими научными знаниями, Питер сконструировал устройство, которое крепится к его запястьям и позволяет «выстреливать» паутиной. Питер берёт псевдоним Человек-паук, надевает костюм и скрывает от всех своё настоящее лицо. Как Человек-паук он становится известной телезвездой. Однажды на студии он упускает шанс остановить вора, который, скрываясь от полицейского, пробежал мимо. Тогда Питер решил, что это «забота полиции, а не звезды». Спустя несколько недель его дядя Бен ограблен и убит и разгневанный Человек-паук отправляется на поиски убийцы, которым оказывается тот самый вор, которого он отказался остановить. Осознав, что «большая сила влечёт за собой большую ответственность», Человек-паук решает лично начать бороться с преступностью.
                      """
        ),
    Hero(id: 13, name: "Тор", film: "Тор", image: "tor",
         description: """
                      высокомерный бог Тор провоцирует возобновление затихшей войны между Асгардом и Йотунхеймом. Из-за этого Тор изгнан из Асгарда на Землю, лишён своих сил и молота Мьёльнира. Поскольку его брат Локи (Хиддлстон) замышляет занять асгардский трон, Тор должен доказать, что достоин.
                      """
        ),
    Hero(id: 14, name: "Эдди Брок", film: "Веном", image: "venom",
         description: """
                      Брок был репортёром, написавшим одну из лживых статей, которого впоследствии разоблачил Питер Паркер, полностью разрушив его карьеру, унизив и вынудив работать в дешёвых журналах. Привлечённый лютой ненавистью Брока к Паркеру, симбиот полностью соединился с Эдди. Появившийся Веном стал ссылаться на себя как «Мы», что означает, что Брок и симбиот по сути были двумя отдельными существами в одном организме, которые кооперировали свои действия. Подгоняемый ненавистью Брока, Веном сражался с Человеком-пауком множество раз и часто был близок к победе. Но, брошенный Человеком-пауком на острове, Брок пересмотрел свои взгляды на жизнь и решил посвятить себя борьбе со злом и в дальнейшем часто помогал Человеку-пауку и другим супергероям. В конце концов, Брок, узнав, что он неизлечимо болен раком, продал симбиота Дону Фортунато.
                      """
        ),
    Hero(id: 15, name: "Питер Квилл", film: "Стражи Галактики", image: "guardians",
         description: """
                      Наполовину человек, наполовину инопланетянин и лидер Стражей, который был похищен из Миссури в детстве в 1988 году и воспитан группой инопланетных воров и контрабандистов, называемых Опустошителями. В детстве ему было нелегко, и теперь он путешествует по космосу, целуется с горячими инопланетными девушками и просто ведёт себя как мошенник и немного придурок, и, объединившись с этими парнями, находит для себя более высокую цель.
                      """
        )
]
